In [1]:
# Muzzafarnagar*
# Noida
# Ghaziabad*
# Meerut
# Agra
# Kanpur
# Lucknow
# Jhansi
# Prayagraj
# Gorakhpur
# Aligarh*
# Varanasi
# Ayodhya
# Mathura
# Bareilly*
# Azamgarh*

In [2]:
import numpy as np
import pandas as pd

s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.184205 -0.303478  0.612998 -0.724647
2013-01-02 -0.200770  0.968425  1.044512  0.617167
2013-01-03 -1.657692  0.295600  0.743017  1.259637
2013-01-04  1.884055  0.038603 -1.670746  0.290497
2013-01-05 -0.922558  0.260703  1.612924  1.339648
2013-01-06 -0.207460  1.407947  0.397214  1.008468

In [5]:
df2 = pd.DataFrame({
    "A": 1.0,
    "B": pd.Timestamp("20130102"),
    "C": pd.Series(1, index = list(range(4)), dtype = "float32"),
    "D": np.array([3] * 4, dtype = "int32"),
    "E": pd.Categorical(["test", "train", "test", "train"]),
    "F": "foo",
})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

df.head()

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -1.184205 -0.303478  0.612998 -0.724647
2013-01-02 -0.200770  0.968425  1.044512  0.617167
2013-01-03 -1.657692  0.295600  0.743017  1.259637
2013-01-04  1.884055  0.038603 -1.670746  0.290497
2013-01-05 -0.922558  0.260703  1.612924  1.339648

In [8]:
df.tail()

                   A         B         C         D
2013-01-02 -0.200770  0.968425  1.044512  0.617167
2013-01-03 -1.657692  0.295600  0.743017  1.259637
2013-01-04  1.884055  0.038603 -1.670746  0.290497
2013-01-05 -0.922558  0.260703  1.612924  1.339648
2013-01-06 -0.207460  1.407947  0.397214  1.008468

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.to_numpy()

array([[-1.1842052 , -0.30347752,  0.61299759, -0.72464747],
       [-0.20077011,  0.96842481,  1.04451194,  0.6171668 ],
       [-1.65769185,  0.29560037,  0.74301663,  1.25963702],
       [ 1.88405549,  0.03860253, -1.67074609,  0.29049724],
       [-0.92255832,  0.26070264,  1.61292389,  1.33964797],
       [-0.20745956,  1.40794709,  0.39721408,  1.00846777]])

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.381438  0.444633  0.456653  0.631795
std    1.245909  0.629746  1.124131  0.773790
min   -1.657692 -0.303478 -1.670746 -0.724647
25%   -1.118793  0.094128  0.451160  0.372165
50%   -0.565009  0.278152  0.678007  0.812817
75%   -0.202442  0.800219  0.969138  1.196845
max    1.884055  1.407947  1.612924  1.339648

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.184205   -0.200770   -1.657692    1.884055   -0.922558   -0.207460
B   -0.303478    0.968425    0.295600    0.038603    0.260703    1.407947
C    0.612998    1.044512    0.743017   -1.670746    1.612924    0.397214
D   -0.724647    0.617167    1.259637    0.290497    1.339648    1.008468

In [16]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01 -0.724647  0.612998 -0.303478 -1.184205
2013-01-02  0.617167  1.044512  0.968425 -0.200770
2013-01-03  1.259637  0.743017  0.295600 -1.657692
2013-01-04  0.290497 -1.670746  0.038603  1.884055
2013-01-05  1.339648  1.612924  0.260703 -0.922558
2013-01-06  1.008468  0.397214  1.407947 -0.207460

In [17]:
df.sort_values(by = "B")

                   A         B         C         D
2013-01-01 -1.184205 -0.303478  0.612998 -0.724647
2013-01-04  1.884055  0.038603 -1.670746  0.290497
2013-01-05 -0.922558  0.260703  1.612924  1.339648
2013-01-03 -1.657692  0.295600  0.743017  1.259637
2013-01-02 -0.200770  0.968425  1.044512  0.617167
2013-01-06 -0.207460  1.407947  0.397214  1.008468

In [18]:
df["A"]

2013-01-01   -1.184205
2013-01-02   -0.200770
2013-01-03   -1.657692
2013-01-04    1.884055
2013-01-05   -0.922558
2013-01-06   -0.207460
Freq: D, Name: A, dtype: float64

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.184205 -0.303478  0.612998 -0.724647
2013-01-02 -0.200770  0.968425  1.044512  0.617167
2013-01-03 -1.657692  0.295600  0.743017  1.259637

In [20]:
df.loc[dates[0]]

A   -1.184205
B   -0.303478
C    0.612998
D   -0.724647
Name: 2013-01-01 00:00:00, dtype: float64

In [21]:
df.loc[:, ["A","B"]]

                   A         B
2013-01-01 -1.184205 -0.303478
2013-01-02 -0.200770  0.968425
2013-01-03 -1.657692  0.295600
2013-01-04  1.884055  0.038603
2013-01-05 -0.922558  0.260703
2013-01-06 -0.207460  1.407947

In [22]:
df.loc["20130102",["A","B"]]

A   -0.200770
B    0.968425
Name: 2013-01-02 00:00:00, dtype: float64

In [23]:
df.loc[dates[0],"A"]

-1.1842051973188605

In [24]:
df.at[dates[0], "A"]

-1.1842051973188605

In [25]:
df.iloc[3]

A    1.884055
B    0.038603
C   -1.670746
D    0.290497
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.884055  0.038603
2013-01-05 -0.922558  0.260703

In [27]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02 -0.200770  1.044512
2013-01-03 -1.657692  0.743017
2013-01-05 -0.922558  1.612924

In [28]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.200770  0.968425  1.044512  0.617167
2013-01-03 -1.657692  0.295600  0.743017  1.259637

In [29]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.303478  0.612998
2013-01-02  0.968425  1.044512
2013-01-03  0.295600  0.743017
2013-01-04  0.038603 -1.670746
2013-01-05  0.260703  1.612924
2013-01-06  1.407947  0.397214

In [30]:
df.iloc[1,1]

0.968424812540473

In [31]:
df.iat[1,1]

0.968424812540473

In [32]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-04  1.884055  0.038603 -1.670746  0.290497

In [33]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.612998       NaN
2013-01-02       NaN  0.968425  1.044512  0.617167
2013-01-03       NaN  0.295600  0.743017  1.259637
2013-01-04  1.884055  0.038603       NaN  0.290497
2013-01-05       NaN  0.260703  1.612924  1.339648
2013-01-06       NaN  1.407947  0.397214  1.008468

In [34]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -1.184205 -0.303478  0.612998 -0.724647    one
2013-01-02 -0.200770  0.968425  1.044512  0.617167    one
2013-01-03 -1.657692  0.295600  0.743017  1.259637    two
2013-01-04  1.884055  0.038603 -1.670746  0.290497  three
2013-01-05 -0.922558  0.260703  1.612924  1.339648   four
2013-01-06 -0.207460  1.407947  0.397214  1.008468  three

In [35]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -1.657692  0.295600  0.743017  1.259637   two
2013-01-05 -0.922558  0.260703  1.612924  1.339648  four

In [36]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [37]:
df.at[dates[0], "A"] = 0
df.iat[0,1] = 0

In [38]:
df.loc[:, "D"] = np.array([5] * len(df))

In [39]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.612998  5
2013-01-02 -0.200770  0.968425  1.044512  5
2013-01-03 -1.657692  0.295600  0.743017  5
2013-01-04  1.884055  0.038603 -1.670746  5
2013-01-05 -0.922558  0.260703  1.612924  5
2013-01-06 -0.207460  1.407947  0.397214  5

In [40]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.612998 -5
2013-01-02 -0.200770 -0.968425 -1.044512 -5
2013-01-03 -1.657692 -0.295600 -0.743017 -5
2013-01-04 -1.884055 -0.038603 -1.670746 -5
2013-01-05 -0.922558 -0.260703 -1.612924 -5
2013-01-06 -0.207460 -1.407947 -0.397214 -5

In [41]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns)+["E"])

In [42]:
df1.loc[dates[0]:dates[1], "E"] = 1
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.612998  5  1.0
2013-01-02 -0.200770  0.968425  1.044512  5  1.0
2013-01-03 -1.657692  0.295600  0.743017  5  NaN
2013-01-04  1.884055  0.038603 -1.670746  5  NaN

In [43]:
df1.dropna(how = "any")

                  A         B         C  D    E
2013-01-01  0.00000  0.000000  0.612998  5  1.0
2013-01-02 -0.20077  0.968425  1.044512  5  1.0

In [44]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.612998  5  1.0
2013-01-02 -0.200770  0.968425  1.044512  5  1.0
2013-01-03 -1.657692  0.295600  0.743017  5  5.0
2013-01-04  1.884055  0.038603 -1.670746  5  5.0

In [45]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [46]:
df.mean()

A   -0.184071
B    0.495213
C    0.456653
D    5.000000
dtype: float64

In [47]:
df.mean(1)

2013-01-01    1.403249
2013-01-02    1.703042
2013-01-03    1.095231
2013-01-04    1.312978
2013-01-05    1.487767
2013-01-06    1.649425
Freq: D, dtype: float64

In [48]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000  0.612998   5
2013-01-02 -0.200770  0.968425  1.657510  10
2013-01-03 -1.858462  1.264025  2.400526  15
2013-01-04  0.025594  1.302628  0.729780  20
2013-01-05 -0.896965  1.563330  2.342704  25
2013-01-06 -1.104424  2.971277  2.739918  30

In [49]:
s = pd.Series(np.random.randint(0, 7, size = 10))
s

0    6
1    3
2    3
3    5
4    1
5    0
6    3
7    0
8    4
9    3
dtype: int32

In [50]:
s.value_counts()

3    4
0    2
6    1
5    1
1    1
4    1
dtype: int64

In [51]:
s = pd.Series(["A", "B", "C", "AaBb", "Baca",np.nan, "CABA", "dog","cat"])
s.str.lower()

0       a
1       b
2       c
3    aabb
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object